
&НаСервере
Функция КлиентПриИзмененииНаСервере(Ссылка)
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Клиенты.Ссылка КАК Ссылка,
	               |	Клиенты.Адрес КАК Адрес,
	               |	Клиенты.Телефон КАК Телефон,
	               |	Клиенты.ДополнительныйАдрес КАК ДополнительныйАдрес
	               |ИЗ
	               |	Справочник.Клиенты КАК Клиенты
	               |ГДЕ
	               |	Клиенты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Клиент);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Альфа = Новый Массив(2);
	Альфа[0] = РезультатЗапроса.Получить(0).Адрес;
	Альфа[1] = РезультатЗапроса.Получить(0).Телефон;
	
	Возврат Альфа 
	
КонецФункции

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	Бета = КлиентПриИзмененииНаСервере(Объект.Клиент);
	Объект.Адрес = Бета[0];
	Объект.Телефон = Бета[1];
КонецПроцедуры

&НаСервере
Функция ТаблицаЗаказТоварПриИзмененииНаСервере(Товары)
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ЦенаТовара.Товары КАК Товары,
	|	ЦенаТовара.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.ЦенаТовара КАК ЦенаТовара
	|ГДЕ
	|	ЦенаТовара.Товары = &Товары";
	
	Запрос.УстановитьПараметр("Товары", Товары);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Омега = РезультатЗапроса.Получить(0).Цена; 
	
	Возврат Омега 
КонецФункции

&НаКлиенте
Процедура ТаблицаЗаказТоварПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТаблицаЗаказ.ТекущиеДанные;
	Дельта = ТаблицаЗаказТоварПриИзмененииНаСервере(ТекущиеДанные.Товар);
	ТекущиеДанные.ЦенаЗаШтуку = Дельта;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗаказКоличествоПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТаблицаЗаказ.ТекущиеДанные;
	ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ТекущиеДанные.ЦенаЗаШтуку;
	
КонецПроцедуры
