
&НаКлиенте
Процедура ЗПОкладПриИзменении(Элемент)
	СТЧ = Элементы.ЗП.ТекущиеДанные;
	РаботаСДокументами.РасчетНдфл(СТЧ);
	РаботаСДокументами.РасчетЗп(СТЧ);
КонецПроцедуры

&НаКлиенте
Процедура ЗПРабочихДнейВМесяцеПриИзменении(Элемент)
	СТЧ = Элементы.ЗП.ТекущиеДанные;
	РаботаСДокументами.РасчетНдфл(СТЧ);
	РаботаСДокументами.РасчетЗп(СТЧ);
КонецПроцедуры

&НаКлиенте
Процедура ЗПФактическиОтработаноПриИзменении(Элемент)
	СТЧ = Элементы.ЗП.ТекущиеДанные;
	РаботаСДокументами.РасчетНдфл(СТЧ);
	РаботаСДокументами.РасчетЗп(СТЧ);
КонецПроцедуры

&НаКлиенте
Процедура ЗППремияПриИзменении(Элемент)
	СТЧ = Элементы.ЗП.ТекущиеДанные;
	РаботаСДокументами.РасчетНдфл(СТЧ);
	РаботаСДокументами.РасчетЗп(СТЧ);
КонецПроцедуры

&НаКлиенте
Процедура ЗПНДФЛПриИзменении(Элемент)
	СТЧ = Элементы.ЗП.ТекущиеДанные;
	РаботаСДокументами.РасчетЗп(СТЧ);
КонецПроцедуры

&НаКлиенте
Процедура ЗПСотрудникПриИзменении(Элемент)
	СТЧ = Элементы.ЗП.ТекущиеДанные;
	СТЧ.Оклад = РаботаСоСправочниками.Оклад(Объект.Дата, СТЧ.Сотрудник);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Дата = ТекущаяДата();
	Объект.ДатаНачалаПериода = НачалоДня (НачалоМесяца (Объект.Дата));
	Объект.ДатаОкончаниеПериода = КонецДня (КонецМесяца (Объект.Дата));
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьТабличнуюЧасть()
Запрос = Новый Запрос;
      Запрос.Текст =
	  "ВЫБРАТЬ
	  |	Оклады.Сотрудник КАК Сотрудник,
	  |	Оклады.Оклад КАК Оклад
	  |ИЗ
	  |	РегистрСведений.Оклады КАК Оклады";
    РезультатЗапроса = Запрос.Выполнить().Выгрузить();
    
	Для каждого Стр из РезультатЗапроса Цикл
        НоваяСтрока = Объект.ЗП.Добавить();
        НоваяСтрока.Сотрудник = Стр.Сотрудник;
		НоваяСтрока.Оклад = Стр.Оклад;
    КонецЦикла
КонецПроцедуры
