 &НаКлиенте
Процедура ВставитьКартинку(Команда)

Оповещение = Новый ОписаниеОповещения("ОбработатьВыборФайла",ЭтотОбъект);
НачатьПомещениеФайла(Оповещение,,,Истина, УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФайлКартинки(Команда)
Оповещение = Новый ОписаниеОповещения("ОбработатьВыборФайла",ЭтотОбъект);
НачатьПомещениеФайла(Оповещение,,,Истина, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборФайла(Результат, Адрес,
ВыбранноеИмяФайла,ДополнительныйПараметр) Экспорт
Если НЕ Результат Тогда
Возврат;
КонецЕсли;
СсылкаНаКартинку = Адрес;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
Если ЭтоАдресВременногоХранилища(СсылкаНаКартинку) Тогда
ТекущийОбъект.ДанныеКартинки = Новый
ХранилищеЗначения(ПолучитьИзВременногоХранилища(СсылкаНаКартинку));
КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
СсылкаНаКартинку = ПолучитьНавигационнуюСсылку(Объект.Ссылка,
"ДанныеКартинки");
КонецПроцедуры

&НаСервере
Функция ДолжностьПриИзмененииНаСервере()
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
		|	ЗаработнаяПлата.Должность КАК Должность,
		|	ЗаработнаяПлата.Оклад КАК Оклад
		|ИЗ
		|	РегистрСведений.ЗаработнаяПлата КАК ЗаработнаяПлата
		|ГДЕ
		|	ЗаработнаяПлата.Должность = &Должность";

	Запрос.УстановитьПараметр("Должность", Объект.Должность);
 
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Альфа = РезультатЗапроса.Получить(0).Оклад;
	Возврат Альфа ;
	
	
	КонецФункции

&НаКлиенте
Процедура ДолжностьПриИзменении(Элемент)
	Объект.Оклад =  ДолжностьПриИзмененииНаСервере();
	КонецПроцедуры
